# Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что 
# на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.

# a = 1
# b = 2
# c = 3
# d = 4
# e = 5
# f = 8
# g = 10
# dictionary = {"A":"a", "E":"a", "I":"a", "O":"a", "U":"a", "L":"a", "N":"a", "S":"a", "T":"a", "R":"a", 
# "D": "b", "G":"b", "B":"c", "C":"c", "M":"c", "P":"c", "F":"d", "H":"d", "V":"d", "W":"d", "Y":"d", 
# "K":"e", "J":"f", "X":"f", "Q":"g", "Z":"g", "А":"a", "В":"a", "Е":"a", "И":"a", "Н":"a", "О":"a", 
# "Р":"a", "С":"a", "Т":"a", "Д":"b", "К":"b", "Л":"b", "М":"b", "П":"b", "У":"b", "Б":"c", "Г":"c", 
# "Ё":"c", "Ь":"c", "Я":"c", "Й":"d", "Ы":"d", "Ж":"e", "З":"e", "Х":"e", "Ц":"e", "Ч":"e", 
# "Ш":"f", "Э":"f", "Ю":"f", "Ф":"g", "Щ":"g", "Ъ":"g"}

dictionary = {
'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U': 1, 'L': 1, 'N': 1, 'S': 1, 'T': 1, 'R': 1, 'А': 1, 'В': 1, 'Е': 1,
'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1, 'D': 2, 'G': 2, 'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2,
'У': 2, 'B': 3, 'C': 3, 'M': 3, 'P': 3, 'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3, 'F': 4, 'H': 4, 'V': 4,
'W': 4, 'Y': 4, 'Й': 4, 'Ы': 4, 'K': 5, 'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'J': 8, 'X': 8, 'Ш': 8,
'Э': 8, 'Ю': 8, 'Q': 10, 'Z': 10, 'Ф': 10, 'Щ': 10, 'Ъ': 10}

word = str.upper(input('Введите слово: '))
s = 0
for i in word:
    s += dictionary[i]
print(s, 'очков')